In [1]:
import pandas as pd
import numpy as np

In [3]:
np.random.seed(101)

In [4]:
df = pd.DataFrame(np.random.randint(1,100,25).reshape(5,5), ['A','B', 'C', 'D', 'E'], ["V",'W','X','Y', 'Z'])
df

    V   W   X   Y   Z
A  96  12  82  71  64
B  88  76  10  78  41
C   5  64  41  61  93
D  65   6  13  94  41
E  50  84   9  30  60

In [11]:
df.std(axis=1)

A    32.000000
B    32.462286
C    32.529986
D    36.588249
E    28.632150
dtype: float64

In [ ]:
df.xs()

In [74]:
df[['V','Y']]

    V   Y
A  55  94
B  38  73
C  23  46
D  53  16
E  38   3

In [78]:
df['new'] = df['V'] + df['Y']
df

    V   W   X   Y   Z  new
A  55  99  81  94  17  149
B  38  59  41  73  73  111
C  23  43  39  46  17   69
D  53  18  23  16  19   69
E  38  49   3   3  32   41

In [79]:
df.drop('new',axis=1, inplace=True)                            #----------------- In pandas 0 == Index(Row) && 1 == Column

In [81]:
df

    V   W   X   Y   Z
A  55  99  81  94  17
B  38  59  41  73  73
C  23  43  39  46  17
D  53  18  23  16  19
E  38  49   3   3  32

In [85]:
df.loc['A']

V    55
W    99
X    81
Y    94
Z    17
Name: A, dtype: int32

DF 2 ######### Lecture 2

In [87]:
df[df>30]

      V     W     X     Y     Z
A  55.0  99.0  81.0  94.0   NaN
B  38.0  59.0  41.0  73.0  73.0
C   NaN  43.0  39.0  46.0   NaN
D  53.0   NaN   NaN   NaN   NaN
E  38.0  49.0   NaN   NaN  32.0

In [89]:
df['W'] > 30

A     True
B     True
C     True
D    False
E     True
Name: W, dtype: bool

In [91]:
df[df['W'] > 30]

    V   W   X   Y   Z
A  55  99  81  94  17
B  38  59  41  73  73
C  23  43  39  46  17
E  38  49   3   3  32

In [95]:
df[df['W'] > 30] [['X','Y']]

    X   Y
A  81  94
B  41  73
C  39  46
E   3   3

In [100]:
df[(df['W'] > 30) & (df['Y'] > 70)]

    V   W   X   Y   Z
A  55  99  81  94  17
B  38  59  41  73  73

In [101]:
df.reset_index()

  index   V   W   X   Y   Z
0     A  55  99  81  94  17
1     B  38  59  41  73  73
2     C  23  43  39  46  17
3     D  53  18  23  16  19
4     E  38  49   3   3  32

In [102]:
df

    V   W   X   Y   Z
A  55  99  81  94  17
B  38  59  41  73  73
C  23  43  39  46  17
D  53  18  23  16  19
E  38  49   3   3  32

In [142]:
newidx = 'IND USA UAE RUS CHN'.split()

In [143]:
newidx

['IND', 'USA', 'UAE', 'RUS', 'CHN']

In [144]:
df['S'] = newidx

In [148]:
df

    V   W   X   Y   Z    S
A  55  99  81  94  17  IND
B  38  59  41  73  73  USA
C  23  43  39  46  17  UAE
D  53  18  23  16  19  RUS
E  38  49   3   3  32  CHN

DF 3 ######### Lecture 3

In [149]:
inside = ['G1', 'G1', 'G1', 'G1', 'G2', 'G2', 'G2', 'G2']
outside = [1,2,3,4,1,2,3,4]
hier_index = list(zip(inside,outside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [154]:
df = pd.DataFrame(np.random.randn(8,2), index = hier_index, columns=['A', 'B'])

In [155]:
inside

['G1', 'G1', 'G1', 'G1', 'G2', 'G2', 'G2', 'G2']

In [156]:
outside

[1, 2, 3, 4, 1, 2, 3, 4]

In [158]:
hier_index

MultiIndex(levels=[['G1', 'G2'], [1, 2, 3, 4]],
           labels=[[0, 0, 0, 0, 1, 1, 1, 1], [0, 1, 2, 3, 0, 1, 2, 3]])

In [159]:
df

             A         B
G1 1  0.940120  0.746221
   2 -0.141266  0.085529
   3 -1.883809 -1.314142
   4  2.601240 -0.612552
G2 1 -1.714963  1.350046
   2  1.798990 -1.312854
   3  0.033590 -0.220208
   4 -0.308472 -0.842066

In [162]:
df.loc['G1'].loc[1]['A']

0.9401202710995398

In [163]:
df.index.names = ['Groupes', 'Num']

In [165]:
df

                    A         B
Groupes Num
G1      1    0.940120  0.746221
        2   -0.141266  0.085529
        3   -1.883809 -1.314142
        4    2.601240 -0.612552
G2      1   -1.714963  1.350046
        2    1.798990 -1.312854
        3    0.033590 -0.220208
        4   -0.308472 -0.842066

In [166]:
df.xs(1, level='Num')

                A         B
Groupes
G1       0.940120  0.746221
G2      -1.714963  1.350046

In [2]:
inside = ['G1', 'G1', 'G1', 'G1', 'G2', 'G2', 'G2', 'G2']
outside = [1,2,3,4,1,2,3,4]

In [3]:
df45 = pd.DataFrame([inside, outside])
df45

    0   1   2   3   4   5   6   7
0  G1  G1  G1  G1  G2  G2  G2  G2
1   1   2   3   4   1   2   3   4

In [6]:
df

    V   W   X   Y   Z
A  96  12  82  71  64
B  88  76  10  78  41
C   5  64  41  61  93
D  65   6  13  94  41
E  50  84   9  30  60

In [17]:
df[['Z', 'P']] = df[['V', 'W']]

In [20]:
df[['Z', 'Y']]

    Z   Y
A  96  12
B  88  76
C   5  64
D  65   6
E  50  84

In [21]:
df

    V   W   X   Y   Z   P
A  96  12  82  12  96  12
B  88  76  10  76  88  76
C   5  64  41  64   5  64
D  65   6  13   6  65   6
E  50  84   9  84  50  84